print('Привет, Сергей')
x = 43
y = 32
print(x * y)
print("End line")

# Шаги выполнения задания:
# 1. Установка точки останова (breakpoint)
# - В PyCharm, чтобы установить точку остановки (breakpoint), кликаем на номер строки с кодом, где хотим приостановить выполнение программы.
# Например, поставим точку остановки на строке с print('Привет, Сергей'), которая будет первой строкой.
# - После установки точки остановки, на номере строки появляется красный кружок.

# 2. Запуск в режиме "дебага"
# - Для запуска программы в режиме "дебага", кликаем иконку с изображением "жучка" ("debug" или "дебаг") рядом с кнопкой запуска в правом верхнем углу PyCharm.
# - Нажимаем на иконку с изображением "жучка" (или используем сочетание клавиш Shift + F9).

# 3. Использование "Step Over"
# - После того как программа приостановится на точке остановки, используем "Step Over" (или нажимая F8), чтобы шагать по строкам программы, не заходя в функции.
# - Просматриваем изменения в консоли и убеждаемся, что программа выполняется поэтапно.
